Repository: reingart/pymotw
Catalog: locale/*/LC_MESSAGES/about.po
Languages: es

source: About Python Module of the Week
es: Acerca del Módulo Python de la semana

source: PyMOTW is a series of blog posts written by `Doug Hellmann <http://www.doughellmann.com/>`_. It was started as a way to build the habit of writing something on a regular basis. The focus of the series is building a set of example code for the modules in the `Python <http://www.python.org/>`_ standard library.
es: PyMOTW es una serie de artículos escritos originalmente por `Doug Hellmann <http://www.doughellmann.com/>`_. Fue iniciado como una manera de crear un habito de escribir algo con una frecuencia regular. El foco de la serie es construir un conjunto de ejemplos de código para los módulos de la Biblioteca estándard de `Python <http://www.python.org/>`_.

source: See the project home page at http://pymotw.com/ for updates and the latest release. Source code is available from http://bitbucket.org/dhellmann/pymotw/.
es: Ver la página principal en http://pymotw.com/ para actualizaciones y la última publicación. El código fuente está disponible desde http://bitbucket.org/dhellmann/pymotw/.

source: Complete documentation for the standard library can be found on the Python web site at http://docs.python.org/library/.
es: La documentación completa para la biblioteca estándar puede encontrarse en el sitio web de Python en http://docs.python.org/library/.

source: Tools
es: Herramientas

source: The source text for PyMOTW is reStructuredText_ and the HTML and PDF output are created using Sphinx_.
es: El texto fuente de PyMOTW es reStructuredText_ y la salida HTML y PDF son creadas usando Sphinx_.

source: The output from all the example programs has been generated with CPython (see below for version) and inserted into the text using cog_.
es: La salida de todos los programas ejemplo ha sido generada con CPython (ver abajo para la versión) e insertado dentro del texto usando cog_.

source: Some of the features described here may not be available in earlier versions of the standard library. When in doubt, refer to the documentation for the version of Python you are using.
es: Algunas de las características descriptas aquí pueden no estar disponibles en versiones anteriores de la biblioteca estándar. Ante la duda, referirse a la documentación de la versión de Python que esté usando.

source: Subscribe
es: Suscribirse

source: As new articles are written, they are posted to my blog (http://blog.doughellmann.com/). Updates are available by RSS from http://feeds.doughellmann.com/PyMOTW and `email <http://feedburner.google.com/fb/a/mailverify?uri=PyMOTW&amp;loc=en_US>`_.
es: Al escribirse nuevos artículos, son publicados en el blog (http://blog.doughellmann.com/). Las actualizaciones están disponibles por RSS desde http://feeds.doughellmann.com/PyMOTW y `email <http://feedburner.google.com/fb/a/mailverify?uri=PyMOTW&amp;loc=en_US>`_.

source: The motw Command Line Interface
es: La interfaz motw por línea de comando

source: PyMOTW includes a command line program, ``motw``, to make it even easier to access the examples while you are developing. Simply run ``motw module`` to open the local copy of the HTML text for the named module. There are also options to view the articles in different formats (see the ``-h`` output for details).
es: PyMOTW incluye un programa de consola, ``motw``, para hacer aún más fácil el acceso a los ejemplos mientras usted desarrolla. Simplemente corra ``motw module`` para abrir una copia local del texto HTML para el módulo nombrado. También hay opciones para ver los artículos en formatos diferentes (ver la salida de ``-h`` para detalles).

source: Usage: ``motw [options] <module_name>``
es: Forma de uso: ``motw [opciones] <nombre_del_modulo>``

source: Options:
es: Opciones:

source: show this help message and exit
es: mostrar esta ayuda y salir

source: Print plain-text version of help to stdout
es: Imprimir una versión de la ayuda en texto plano en stdout

source: Open HTML version of help from web
es: Abrir la versión HTML de la ayuda desde la web

source: Open HTML version of help from installed file
es: Abrir la versión HTML de la ayuda desde el archivo instalado

source: Using PyMOTW with the Interactive Interpreter
es: Usando PyMOTW con el interprete interactivo

source: PyMOTW articles are at your fingertips while you're working with the Python interactive interpreter. Importing ``PyMOTW`` adds the function ``motw()`` to the ``__builtins__`` namespace. Run ``motw(module)`` to see the help for an imported module. Enclose the name in quotes for a module that you haven't already imported.
es: Los artículos de PyMOTW están a alcance mientras está trabajando con el interprete interactivo de Python. Importando ``PyMOTW`` agrega la función ``motw()`` al espacio de nombre ``__builtins__``. Ejecutar ``motw(modulo)`` para ver la ayuda de un módulo importado. Encerrar el nombre entre comillas si no lo ha importado aún..

source: Translations and Other Versions
es: Traducciones y Otras Versiones

source: `Chinese <http://www.vbarter.cn/pymotw/>`_
es: `Chino <http://www.vbarter.cn/pymotw/>`_

source: Junjie Cai (蔡俊杰) and Yan Sheng (盛艳) have started a google code project called PyMOTWCN (http://code.google.com/p/pymotwcn/) and posted the completed translations at http://www.vbarter.cn/pymotw/.
es: Junjie Cai (蔡俊杰) y Yan Sheng (盛艳) han iniciado un proyecto en google code llamado PyMOTWCN (http://code.google.com/p/pymotwcn/) y han subido las traducciones completadas en http://www.vbarter.cn/pymotw/.

source: `German <http://schoenian-online.de/pymotw.html>`_
es: `Alemán <http://schoenian-online.de/pymotw.html>`_

source: Ralf Schönian is translating PyMOTW into German, following an alphabetical order. The results are available on his web site, http://schoenian-online.de/pymotw.html. Ralf is an active member of the `pyCologne <http://wiki.python.de/User_Group_K%C3%B6ln?action=show&redirect=pyCologne>`_ user group in Germany and author of pyVoc, the open source English/German vocabulary trainer (http://code.google.com/p/pyvoc/).
es: Ralf Schönian está traduciendo PyMOTW al Alemán, siguiendo un orden alfabético. Los resultados están disponibles en su sitio web, http://schoenian-online.de/pymotw.html. Ralf es un miembro activo del grupo de usuarios `pyCologne <http://wiki.python.de/User_Group_K%C3%B6ln?action=show&redirect=pyCologne>`_ en Alemania y autor de pyVoc, el entrenador de vocabulario Inglés/Aleman de código abierto (http://code.google.com/p/pyvoc/).

source: `Italian <http://robyp.x10host.com/>`_
es: `Italiano <http://robyp.x10host.com/>`_

source: Roberto Pauletto is working on an Italian translation at http://robyp.x10host.com/. Roberto creates Windows applications with C# by day, and tinkers with Linux and Python at home. He has recently moved to Python from Perl for all of his system-administration scripting.
es: Roberto Pauletto está trabajando en una traducción al italiano en http://robyp.x10host.com/.

source: `Japanese <http://ja.pymotw.com/>`_
es: `Japonés <http://ja.pymotw.com/>`_

source: `Tetsuya Morimoto <http://d.hatena.ne.jp/t2y-1979/>`_ is creating a Japanese translation. Tetsuya has used Python for 1.5 years. He has as experience at a Linux Distributor using Python with yum, anaconda, and rpm-tools while building RPM packages. Now, he uses it to make useful tools for himself, and is interested in application frameworks such as Django, mercurial and wxPython. Tetsuya is a member of `Python Japan User's Group <http://www.python.jp/Zope/>`_ and `Python Code Reading <http://groups.google.co.jp/group/python-code-reading>`_. The home page for his translation is http://ja.pymotw.com/.
es: `Tetsuya Morimoto <http://d.hatena.ne.jp/t2y-1979/>`_ está creando una traducción al Japonés. Tetsuya ha usado Python por 1.5 años. Tiene experiencia como Linux Distributor usando Python con yum, anaconda, y rpm-tools mientras construye paquetes RPM. Ahora, lo usa para crear herramientas útiles, y está interesado en frameworks de aplicación como Django, mercurial y wxPython. Tetsuya es un miembro de `Python Japan User's Group <http://www.python.jp/Zope/>`_ y `Python Code Reading <http://groups.google.co.jp/group/python-code-reading>`_. La página principal para esta traducción es http://ja.pymotw.com/.

source: Other Contributors
es: Otros Contribuidores

source: Thank you to John Benediktsson for the original HTML-to-reST conversion.
es: Gracias a John Benediktsson por la conversión origial de HTML-a-reST.

source: Copyright and Licensing
es: Derechos de Autor y Licenciamiento

source: All of the prose from the Python Module of the Week is licensed under a `Creative Commons Attribution, Non-commercial, Share-alike 3.0 <http://creativecommons.org/licenses/by-nc-sa/3.0/us/>`_ license. You are free to share and create derivative works from it. If you post the material online, you must give attribution and link to the PyMOTW home page (http://www.doughellmann.com/PyMOTW/). You may not use this work for commercial purposes. If you alter, transform, or build upon this work, you may distribute the resulting work only under the same or similar license to this one.
es: Toda la prosa del PyMOTW es licenciada bajo una licencia `Creative Commons Attribution, Non-commercial, Share-alike 3.0 <http://creativecommons.org/licenses/by-nc-sa/3.0/us/>` (atribución, no comercial, compartir igual). Usted es libre de compartir y crear obras derivadas del mismo. Si publica el material en linea, debe dar atribución y enlazar a la página inicial de PyMOTW (http://www.doughellmann.com/PyMOTW/). No debe usar esta obra con fines comerciales. Si altera, transforma, o construye en base a esta obra, puede distribuir el trabajo resultante solo bajo la misma licencia o una similar.

source: The source code included here is copyright Doug Hellmann and licensed under the BSD license.
es: El código fuente incluido aquí esta bajo copyright de Doug Hellmann y licenciado bajo la licencia BSD.

source: Copyright Doug Hellmann, All Rights Reserved
es: Copyright Doug Hellmann, todos los derechos reservados
